; domain
;; Transport sequential
;;

(define (domain transport)
  (:requirements :typing :action-costs)
  (:types
        location target locatable - object
        vehicle package - locatable
        capacity-number - object
  )

  (:predicates 
     (road ?l1 ?l2 - location)
     (at ?x - locatable ?v - location)
     (in ?x - package ?v - vehicle)
     (capacity ?v - vehicle ?s1 - capacity-number)
     (capacity-predecessor ?s1 ?s2 - capacity-number)
  )

  (:functions
     (road-length ?l1 ?l2 - location) - number
     (total-cost) - number
  )

  (:action drive
    :parameters (?v - vehicle ?l1 ?l2 - location)
    :precondition (and
        (at ?v ?l1)
        (road ?l1 ?l2)
      )
    :effect (and
        (not (at ?v ?l1))
        (at ?v ?l2)
        (increase (total-cost) (road-length ?l1 ?l2))
      )
  )

 (:action pick-up
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (at ?p ?l)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s2)
      )
    :effect (and
        (not (at ?p ?l))
        (in ?p ?v)
        (capacity ?v ?s1)
        (not (capacity ?v ?s2))
        (increase (total-cost) 1)
      )
  )

  (:action drop
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (in ?p ?v)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s1)
      )
    :effect (and
        (not (in ?p ?v))
        (at ?p ?l)
        (capacity ?v ?s2)
        (not (capacity ?v ?s1))
        (increase (total-cost) 1)
      )
  )

)

; problem
; Transport city-sequential-6nodes-1000size-4degree-100mindistance-2trucks-4packages-592seed

(define (problem transport-city-sequential-6nodes-1000size-4degree-100mindistance-2trucks-4packages-592seed)
 (:domain transport)
 (:objects
  city-loc-1 - location
  city-loc-2 - location
  city-loc-3 - location
  city-loc-4 - location
  city-loc-5 - location
  city-loc-6 - location
  truck-1 - vehicle
  truck-2 - vehicle
  package-1 - package
  package-2 - package
  package-3 - package
  package-4 - package
  capacity-0 - capacity-number
  capacity-1 - capacity-number
  capacity-2 - capacity-number
  capacity-3 - capacity-number
  capacity-4 - capacity-number
 )
 (:init
  (= (total-cost) 0)
  (capacity-predecessor capacity-0 capacity-1)
  (capacity-predecessor capacity-1 capacity-2)
  (capacity-predecessor capacity-2 capacity-3)
  (capacity-predecessor capacity-3 capacity-4)
  ; 360,783 -> 13,351
  (road city-loc-3 city-loc-2)
  (= (road-length city-loc-3 city-loc-2) 56)
  ; 13,351 -> 360,783
  (road city-loc-2 city-loc-3)
  (= (road-length city-loc-2 city-loc-3) 56)
  ; 292,205 -> 768,225
  (road city-loc-5 city-loc-1)
  (= (road-length city-loc-5 city-loc-1) 48)
  ; 768,225 -> 292,205
  (road city-loc-1 city-loc-5)
  (= (road-length city-loc-1 city-loc-5) 48)
  ; 292,205 -> 13,351
  (road city-loc-5 city-loc-2)
  (= (road-length city-loc-5 city-loc-2) 32)
  ; 13,351 -> 292,205
  (road city-loc-2 city-loc-5)
  (= (road-length city-loc-2 city-loc-5) 32)
  ; 738,643 -> 768,225
  (road city-loc-6 city-loc-1)
  (= (road-length city-loc-6 city-loc-1) 42)
  ; 768,225 -> 738,643
  (road city-loc-1 city-loc-6)
  (= (road-length city-loc-1 city-loc-6) 42)
  ; 738,643 -> 360,783
  (road city-loc-6 city-loc-3)
  (= (road-length city-loc-6 city-loc-3) 41)
  ; 360,783 -> 738,643
  (road city-loc-3 city-loc-6)
  (= (road-length city-loc-3 city-loc-6) 41)
  ; 738,643 -> 961,831
  (road city-loc-6 city-loc-4)
  (= (road-length city-loc-6 city-loc-4) 30)
  ; 961,831 -> 738,643
  (road city-loc-4 city-loc-6)
  (= (road-length city-loc-4 city-loc-6) 30)
  (at package-1 city-loc-3)
  (at package-2 city-loc-4)
  (at package-3 city-loc-4)
  (at package-4 city-loc-6)
  (at truck-1 city-loc-3)
  (capacity truck-1 capacity-2)
  (at truck-2 city-loc-1)
  (capacity truck-2 capacity-3)
 )
 (:goal (and
  (at package-1 city-loc-2)
  (at package-2 city-loc-6)
  (at package-3 city-loc-5)
  (at package-4 city-loc-2)
 ))
 (:metric minimize (total-cost))
)

; plan
1. (drive truck-2 city-loc-1 city-loc-6)
   deleted: (at truck-2 city-loc-1)
   added: (at truck-2 city-loc-6)
   goals met: 0 of 4
2. (pick-up truck-2 city-loc-6 package-4 capacity-2 capacity-3)
   deleted: (at package-4 city-loc-6) (capacity truck-2 capacity-3)
   added: (in package-4 truck-2) (capacity truck-2 capacity-2)
   goals met: 0 of 4
3. (drive truck-2 city-loc-6 city-loc-4)
   deleted: (at truck-2 city-loc-6)
   added: (at truck-2 city-loc-4)
   goals met: 0 of 4
4. (pick-up truck-2 city-loc-4 package-3 capacity-1 capacity-2)
   deleted: (at package-3 city-loc-4) (capacity truck-2 capacity-2)
   added: (in package-3 truck-2) (capacity truck-2 capacity-1)
   goals met: 0 of 4
5. (pick-up truck-2 city-loc-4 package-2 capacity-0 capacity-1)
   deleted: (at package-2 city-loc-4) (capacity truck-2 capacity-1)
   added: (in package-2 truck-2) (capacity truck-2 capacity-0)
   goals met: 0 of 4
6. (drive truck-2 city-loc-4 city-loc-6)
   deleted: (at truck-2 city-loc-4)
   added: (at truck-2 city-loc-6)
   goals met: 0 of 4
7. (drop truck-2 city-loc-6 package-2 capacity-0 capacity-1)
   deleted: (in package-2 truck-2) (capacity truck-2 capacity-0)
   added: (at package-2 city-loc-6) (capacity truck-2 capacity-1)
   goals met: 1 of 4
8. (drive truck-2 city-loc-6 city-loc-3)
   deleted: (at truck-2 city-loc-6)
   added: (at truck-2 city-loc-3)
   goals met: 1 of 4
9. (pick-up truck-2 city-loc-3 package-1 capacity-0 capacity-1)
   deleted: (at package-1 city-loc-3) (capacity truck-2 capacity-1)
   added: (in package-1 truck-2) (capacity truck-2 capacity-0)
   goals met: 1 of 4
10. (drive truck-2 city-loc-3 city-loc-2)
   deleted: (at truck-2 city-loc-3)
   added: (at truck-2 city-loc-2)
   goals met: 1 of 4
11. (drop truck-2 city-loc-2 package-1 capacity-0 capacity-1)
   deleted: (in package-1 truck-2) (capacity truck-2 capacity-0)
   added: (at package-1 city-loc-2) (capacity truck-2 capacity-1)
   goals met: 2 of 4
12. (drop truck-2 city-loc-2 package-4 capacity-1 capacity-2)
   deleted: (in package-4 truck-2) (capacity truck-2 capacity-1)
   added: (at package-4 city-loc-2) (capacity truck-2 capacity-2)
   goals met: 3 of 4
13. (drive truck-2 city-loc-2 city-loc-5)
   deleted: (at truck-2 city-loc-2)
   added: (at truck-2 city-loc-5)
   goals met: 3 of 4
14. (drop truck-2 city-loc-5 package-3 capacity-2 capacity-3)
   deleted: (in package-3 truck-2) (capacity truck-2 capacity-2)
   added: (at package-3 city-loc-5) (capacity truck-2 capacity-3)
   goals met: 4 of 4
